In [7]:
import numpy as np
import pandas as pd
a=pd.DataFrame(np.random.randn(5,3),index=["a","b","c","d","e"],columns=["col1","col2","col3"])
print(a)

       col1      col2      col3
a  0.450681  0.625534  0.733230
b -0.407159 -0.265861  0.234360
c  0.470539  1.342299 -0.862745
d -0.205332  2.040450  1.040871
e  1.197232  0.732496 -0.625110

In [8]:
##inserting a column in a Dataframe
a['col4']=0.99
a

       col1      col2      col3  col4
a  0.450681  0.625534  0.733230  0.99
b -0.407159 -0.265861  0.234360  0.99
c  0.470539  1.342299 -0.862745  0.99
d -0.205332  2.040450  1.040871  0.99
e  1.197232  0.732496 -0.625110  0.99

In [9]:
#inserting a column in a Dataframe
a['col5']=0.34
a

       col1      col2      col3  col4  col5
a  0.450681  0.625534  0.733230  0.99  0.34
b -0.407159 -0.265861  0.234360  0.99  0.34
c  0.470539  1.342299 -0.862745  0.99  0.34
d -0.205332  2.040450  1.040871  0.99  0.34
e  1.197232  0.732496 -0.625110  0.99  0.34

In [15]:
#inserting a column in a Dataframe
a['col6']=a[a['col3']>0]
a

       col1      col2      col3  col4  col5      col6
a  0.450681  0.625534  0.733230  0.99  0.34  0.450681
b -0.407159 -0.265861  0.234360  0.99  0.34 -0.407159
c  0.470539  1.342299 -0.862745  0.99  0.34       NaN
d -0.205332  2.040450  1.040871  0.99  0.34 -0.205332
e  1.197232  0.732496 -0.625110  0.99  0.34       NaN

In [16]:
a.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5', 'col6'], dtype='object')

In [17]:
a.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
#inserting a row in a DataFrame
a=a.append(pd.DataFrame({'col1':1,'col2':2,'col3':3,'col4':4,'col5':5,'col6':6},index=['f']))
a

       col1      col2      col3  col4  col5      col6
a  0.450681  0.625534  0.733230  0.99  0.34  0.450681
b -0.407159 -0.265861  0.234360  0.99  0.34 -0.407159
c  0.470539  1.342299 -0.862745  0.99  0.34       NaN
d -0.205332  2.040450  1.040871  0.99  0.34 -0.205332
e  1.197232  0.732496 -0.625110  0.99  0.34       NaN
f  1.000000  2.000000  3.000000  4.00  5.00         6

In [20]:
a['col2'].value_counts().sum()#it counts only unique index sum

6

In [22]:
a['col2'].sum()#it counts all sum

6.474917310575333

In [24]:
print(a['col2'].cumsum())

a    0.625534
b    0.359673
c    1.701972
d    3.742421
e    4.474917
f    6.474917
Name: col2, dtype: float64

In [25]:
a['col2'].prod()

-0.6672931236129913

In [26]:
a['col2'].cumprod()

a    0.625534
b   -0.166305
c   -0.223232
d   -0.455493
e   -0.333647
f   -0.667293
Name: col2, dtype: float64

In [27]:
a['col2'].max()

2.040449568873648

In [28]:
a['col2'].min()

-0.26586135032399555